{
  "name": "earth nation food data",
  "description": "Earth Kingdom\r\nEarth Kingdom cuisine\r\nThe Earth Kingdom offers a variety of dishes, some of which were served to Zuko and Iroh when they visited Song's home.\r\n\r\nPeople in the Earth Kingdom grow and eat a wide variety of foods, including fruits, vegetables, and rice; meat, such as beef and poultry, from wild game and farms is also common.[2][72] There are many regional variations in the types of food eaten, ranging from simpler village fare to the elaborate roasts, cakes, and other delicacies found in Ba Sing Se. While having a meal in Ba Sing Se, Zuko commented that the food tasted almost identical to Fire Nation food but less seasoned.[73]\r\n\r\nCooking style\r\nDue to its size, the Earth Kingdom has many variations in climate which in turn affect food preparation, resulting in a variety of cooking methods being utilized in the nation. While in Gaoling and the Upper Ring of Ba Sing Se, the cuisine is characterstic for its sweet and sour flavor, the food in the west is significantly more sour, rich in spices, and sometimes spicy. In the forested areas, dishes are usually spit-roasted or smoldered underground in clay or dirt. The islands of the Earth Kingdom, however, use more seafood and have more influences from the Fire Nation due to their proximity and the blend of cuisines in the colonies.[74] Boiling is used for rice and many vegetables, while fish is usually steamed and meats are generally roasted. Baking is used extensively to make cakes, buns, and tarts. In the metal city of Zaofu, they serve a fusion cuisine of gourmet and vegetarian entrées, most of which use specially prepared ingredients such as kale.\r\n\r\nCommon ingredients\r\nGrains\r\nBean — A useful travel food.[75]\r\nBread — Can be made from flour.[76]\r\nCorn — A cereal grain with a leafy stalk.[77]\r\nFlour — Can be made into a variety of foods, including doughs and paste.[78][75]\r\nLentil — A useful travel food.[75]\r\nRice — A staple crop.[2][29] Wealthy people generally eat more white rice, while the less wealthy eat more brown rice.[74]\r\nWheat — Can be made into flour.[79][62]\r\nFish, meat, and dairy\r\nBeef — Used by the Earth Kingdom elite.[80]\r\nChicken — Usually roasted.[81]\r\nCrab — Made into crab puffs.[77]\r\nDuck — Usually roasted.[82] Its claws are also used in soups.[83]\r\nPlatypus bear egg\r\nPlatypus bears lay enormous eggs that can be eaten.\r\n\r\nEgg — Used in a variety of ways.\r\nChicken egg — Used in a variety of ways.[84]\r\nPlatypus bear egg — Used in a variety of ways.[85]\r\nElephant rat — Eaten by the daofei to survive in the wild.[86]\r\nFish — Usually steamed or seared.[87][88]\r\nElephant koi[89]\r\nLamb — Used by the Earth Kingdom elite.[80]\r\nLobster crab — Usually boiled or roasted.[90]\r\nPossum chicken — Consumed by members of the Foggy Swamp Tribe.[51]\r\nWild crab urchin — Usually stir-fried.[35]\r\nFruits, vegetables, seeds, and fungi\r\nAloe — Used for tea.[91]\r\nApple — Varieties include at least red and yellow.[92][72][93]\r\nBanana[94]\r\nBerries[95]\r\nCabbage — Usually boiled, stir-fried, or left uncooked and used as garnish.[96]\r\nCantaloupe[97]\r\nCarrot[98]\r\nChili — Used as a flavoring.\r\nCucumber — Used in a variety of dishes and for tea.[87][91]\r\nDaikon radish[87]\r\nDragonfruit[94]\r\nDumpling weed — Found in the northern part of Kyoshi Island and consumed as both a poverty food and a regular ingredient.[99][100]\r\nEggplant[87]\r\nFava bean — Used to make doubanjiang, a fermented fava bean paste.[83]\r\nGinger — Used for tea.[101]\r\nGrape — Edible green berry procured from grapevines;[102] can be purchased from fruit stands in the Lower Ring of Ba Sing Se.[94]\r\nKale — A staple ingredient in Zaofu cuisine.[103]\r\nKelp — Can be pickled and spiced.[104]\r\nLemon[78]\r\nLettuce — Can be boiled, stir-fried, or left uncooked and used as garnish.[81]\r\nLotus root — Used in salad.[105]\r\nLychee nut — Small reddish-brown fruit that can be used to make tea and egg tarts' crust.[88][32]\r\nMango — Eaten[85] and used to make a beverage of the same name.[106] Also, can be made into pomace.[107]\r\nMoon peaches[7]\r\nMustard — Used in soups.[83]\r\nOnion — Ingredient in bark-onion soup.[108]\r\nOrange — Snacked on and used in some wagashi desserts.[94]\r\nPapaya[85][109]\r\nPapaya purchase\r\nKatara purchased papaya on the recommendation of Aunt Wu, even though she loathed the fruit.\r\n\r\nPear — Edible green fruit; can be purchased from fruit stands in the Lower Ring of Ba Sing Se.[94]\r\nPepper — Used in soups.[83]\r\nPersimmon — An astringent tree fruit.[110]\r\nPlum[78]\r\nPumpkin — Can be made into pumpkin pie.[111][112]\r\nSesame[113]\r\nSoy — Used to make tofu.[114][35]\r\nSweet potato[115]\r\nTapioca — Used for bubble tea.[116][117][118]\r\nTaro root[87]\r\nWatermelon[94]\r\nWild nuts[87]\r\nYam[119]\r\nOther\r\nBrine — Water strongly impregnated with common salt used to pickle food.[104]\r\nChocolate — Used by Katara to make kale cookies.[61]\r\nJennamite — A fast-growing rock candy that can be eaten as a snack. It is also known as creeping crystal.[81][120]\r\nLemon juice[78]\r\nMaple syrup[121]\r\nPeanut — A small legume which can be made into a sauce. The sauce can also be used to craft certain explosives.[25]\r\nSalt — A mineral used as a food preservative and flavor enhancer,[9] procured from salt mines, such as the one located in the mountain neighboring Yaoping Town.[122]\r\nSugar[123]\r\nDishes\r\nBark-onion soup — Dish disliked by Baraz.[108]\r\nBean curd puffs — Made in Makapu Village from cottage cheese and beans.[85][124] Sold at the Middle Ring Earthmarket in Ba Sing Se.[125]\r\nBeetle-worm soup — Dish prepared and served by Grandma Lokai.[126]\r\nBison steak — Cooked meat from a flying bison. It is a rare dish that is consumed by citizens of the Upper Ring of Ba Sing Se.[127]\r\nBraised turtle duck — Sold at the Middle Ring Earthmarket in Ba Sing Se.[8][125]\r\nCabbage bun — Sold in Ba Sing Se. Eaten with warm broth inside.[128][129]\r\nCabbage cookies — A signature dish of the cabbage merchant in his Cabbage Delicacies Bistro.[123] One of his customers' favorite.[83]\r\nCabbage noodles — A signature dish of the cabbage merchant in his Cabbage Delicacies Bistro.[123]\r\nCabbage soup — A signature dish of the cabbage merchant in his Cabbage Delicacies Bistro.[123] The dish was offered to travelers who stopped into the restaurant for an early supper.[83]\r\nCakes — Baked pastries enjoyed by Bosco.[130]\r\nChocolate mousse — Became more common in Ba Sing Se later in the war, as refugees tried to establish themselves with new recipes.[131]\r\nCookie of the White Lotus — Crispy and crumbly cookies used as a prize for Pai Sho players in the Order of the White Lotus.[132]\r\nCrab puffs — Crab meat made into puffs.[77]\r\nCrab urchin stir-fry — Wild crab urchins prepared and stir-fried with cooking oil imported from the Upper Ring of Ba Sing Se. This was Jianzhu's favorite dish.[35]\r\nDeep-fried pickled radishes — A deep-fried vegetable that Katara considered as having a pleasing aroma.[133] Sold at the Middle Ring Earthmarket in Ba Sing Se.[125]\r\nEgg custard tart\r\nEgg custard tart was Aang's favorite food.\r\n\r\nDried mango[119]\r\nDried sweet potato — A dried vegetable consumed by residents of the daofei settlement of Hujiang.[75]\r\nDumplings — Pieces of dough wrapped around a filling of meat and/or vegetables, such as leek.[104] Types of dumplings include dao bao and xialongbao.[114]\r\nDragon Dumplings — A popular dish sold by the Double Dumpling restaurant in Omashu. They are described as plump, succulent, fluffy, sweet, and fiery hot, promising an explosion of flavor. It is rumored that these dumplings may or may not contain mongoose dragon.[98]\r\nDumpling weed soup[100]\r\nEgg custard tart — Baked tart with an egg custard center.[1][129]\r\nFried cookies — Sold in Ba Sing Se markets.[131]\r\nFried dough — Flour dough that is fried.[134]\r\nGinger-infused pea tendril and hibiscus-root salad — An aromatic vegetarian side-dish served in gourmet meals.[89]\r\nGrilled sausage — Sold in Ba Sing Se markets.[131]\r\nJook — Rice congee (a kind of porridge).[20][135]\r\nKale wraps[105]\r\nMeat kebabs[136]\r\nMisty Palms special rice — Made in the Misty Palms Oasis.[137]\r\nMoon peach cakes — Dessert made in Ba Sing Se from moon peaches.[125]\r\nNoodle soup — Noodles and various vegetables and meats cooked in soup.\r\nPan-fried noodles[114]\r\nPau buns\r\nPies — Baked pastries enjoyed by Bosco.[130]\r\nPumpkin pie[111]\r\nRamen — Noodle soup prepared in a variety of ways.[114]\r\nRoast boar — Roasted over a spit; made by the Freedom Fighters.[138]\r\nRoast duck — A duck that is seasoned with herbs and spices, roasted, and applied with a special sauce.[82][139][129]\r\nRice gruel — A meal consumed by residents of the daofei settlement of Hujiang.[75]\r\nSeared wild Kyoshi elephant koi — A gourmet meal prepared by pan-searing fresh elephant koi. Often served with complementary side dishes, such as hibiscus root salad.[89] Found in restaurants all over the Earth Kingdom.[140]\r\nSeaweed soup — A remedy for blood loss.[141]\r\nSeaweed wraps — Small rolls wrapped in seaweed.[90]\r\nSoup — Made from a variety of meats and vegetables; usually thin.\r\nSpicy pickled kelp — Considered a delicacy.[104]\r\nSteamed buns[99]\r\nStuffed apple donuts — Dessert commonly prepared and eaten during Kyoshi Day at Kyoshi Island.[93]\r\nSugar cookies[123]\r\nSushi — Small cutlets of fish rolled in rice and seaweed. It is often eaten by the inhabitants of Kyoshi Island.[134]\r\nTea eggs — Used by Toph for picnics with the badgermoles. She also carried some eggs during her travels with Team Avatar.[142]\r\nTofu — Tofu made into smaller puffs and fried.[114]\r\nUnfried dough — Regular flour dough, cut into the shape of Avatar Aang. Exclusive dish of Chin Village.[134][113]\r\nVegetable wrap — A vegetarian course often served raw and made out of leafy produce, such as kale.[103]\r\nWagashi desserts — Small puff pastries with various toppings and fillings. These desserts are eaten on Kyoshi Island,[87] as well as being consumed at parties in Ba Sing Se.[77]\r\nBeverages\r\nCactus juice\r\nThe liquid trapped inside cacti has strong hallucinogenic properties.\r\n\r\nCactus juice — Named by Sokka, this liquid is consumed straight from cacti found in the Si Wong Desert and has strong hallucinogenic properties.[143]\r\nEarthbender mudslide — Invigorating drink.[121]\r\nKale smoothie[144]\r\nKalenutsco — Fresh drink made from a mixture of kale, walnuts, and coconut water, pioneered by Suyin Beifong's chef in Zaofu.[145]\r\nLychee nut ice smoothie — Made in the Misty Palms Oasis.[137]\r\nMango — Made from mangoes and other fruits mixed with water in an ice bowl.[106] After the war, Iroh sometimes made this drink for Katara when the team did not have time to visit the Misty Palms Oasis.[146]\r\nMilk — Dairy product sometimes added to tea.[116]\r\nTea — Made from a variety of tea leaves in hot water.[147] Varieties include ginseng, jasmine, green, ginger, cucumber, lychee, and oolong.[20][148][149]\r\nBubble tea — A popular tea in the Jasmine Dragon made with tapioca balls.[116][117][118]\r\nChi-enhancing tea — A rare tea and natural stimulant known to improve an ordinary warrior's strength and energy tenfold.[150]\r\nKombucha tea — A cold version of Iroh's jasmine blend.[101]\r\nPearl-milk tea — Tea served with balls of softened tapioca at the bottom of the glass, pioneered by Iroh.[116]\r\nWine — A beverage typically made from distilling alcohol from fruits or honey.[151][152][75]\r\nOthers\r\nMint — A small piece of candy.[73]"
}