{
  "name": "fauna data 1",
  "description": "Fauna in the World of Avatar\r\n(Redirected from Fauna)\r\n42\r\nEdit\r\n\r\nFox antelope\r\nFauna in the World of Avatar\r\nGeneral information\r\nType\r\nFauna and habitats\r\nExamples\r\nBadgermole\r\nDragon\r\nFlying bison\r\nShirshu\r\nMore about the World of Avatar\r\nA vast range of fauna inhabit the world, ranging over virtually every landscape as well as the oceans and skies. Most of the animals presented are hybrids of two real world animals; sometimes this hybridization is explicit, at other times more subtle. There are certain exceptions though, such as Kuei's pet bear, Bosco, the herbalist's cat, Miyuki, or the dragon hawk.\r\n\r\nContents\r\n1\tHabitats\r\n1.1\tFoggy Swamp\r\n1.2\tGreat Divide\r\n1.3\tPoles\r\n1.4\tSi Wong Desert\r\n2\tList of fauna\r\n2.1\tAir Nomads\r\n2.1.1\tTerrestrial\r\n2.1.2\tFlying\r\n2.2\tWater Tribe\r\n2.2.1\tAquatic/semiaquatic\r\n2.2.2\tTerrestrial\r\n2.3\tEarth Kingdom\r\n2.3.1\tAquatic/semiaquatic\r\n2.3.2\tFlying\r\n2.3.3\tTerrestrial\r\n2.4\tFire Nation\r\n2.4.1\tAquatic/semiaquatic\r\n2.4.2\tFlying\r\n2.4.3\tTerrestrial\r\n2.5\tUnited Republic of Nations\r\n2.5.1\tAquatic/semiaquatic\r\n2.5.2\tFlying\r\n2.5.3\tTerrestrial\r\n2.6\tSpirit World\r\n2.6.1\tAquatic/semiaquatic\r\n2.6.2\tFlying\r\n2.6.3\tTerrestrial\r\n2.7\tOthers\r\n2.7.1\tAquatic/semiaquatic\r\n2.7.2\tFlying\r\n2.7.3\tTerrestrial\r\n3\tNotes\r\n4\tReferences\r\nHabitats\r\nThere are several distinct habitats in the Avatar World, suitable for different animals and plants.\r\n\r\nFoggy Swamp\r\nDue to the wet climate and abundant vegetation, the Foggy Swamp plays host to a large variety of fauna. Hundreds of living things are densely packed into the swamp; this includes swamp fireflies, elbow leeches, screeching dodos, and catgators.[1]\r\n\r\nGreat Divide\r\nThe Great Divide has various species due to an arid climate. This unique area is home to certain creatures, such as the canyon crawlers.[2]\r\n\r\nPoles\r\nThe low temperatures in both the Northern and Southern Water Tribes do not allow for much fauna to thrive. However, there are some animals that have adapted to the cold environment, such as otter penguins, tiger seals, polar dogs, polar bear dogs, and buffalo yaks.\r\n\r\nSi Wong Desert\r\nThe Si Wong Desert has the driest, hottest climate in the world. The desert's ecosystem primarily consists of a few scavenger species such as the gilacorn, predatory insects known as buzzard wasps, giant rhinoceros beetles, which are used for transportation, scorpions, and jackalopes.[3]\r\n\r\nList of fauna\r\nAir Nomads\r\nTerrestrial\r\nHermit crab — Crustacean that outgrows and replaces its shell.[4]\r\nSquirrel — Small rodent inhabiting the Eastern Air Temple.[5]\r\nFlying\r\nBird — Avian animal found at the Eastern Air Temple in varied colors, including yellow and white.[6]\r\nFirefly — Bioluminescent flying insect.[4]\r\nAppa's mother\r\nAppa's mother, a flying bison, guided her calves to be chosen by young Air Nomads.\r\n\r\nFlying bison — Large, flying mammal sacred to the Air Nomads as the original airbender.[7]\r\nKitten moth — Cross between a cat and a moth that lives in the Northern Air Temple.[8]\r\nRing-tailed winged lemur — Flying gray primate kept as a pet.[9]\r\nSpider bat — Cross between a spider and bat that inhabits empty bison stables at the Eastern Air Temple following the genocide of the Air Nomads.[10]\r\nSpiderfly — Cross between a spider and fly that sometimes gets caught in its own web.[11][12][13]\r\nWinged lemur — Flying black and white primate kept as a pet.[14]\r\nWater Tribe\r\nAquatic/semiaquatic\r\nArctic hippo — Mammal that lives in the South Pole region and is hunted for its blubber.[15]\r\nArctic seal — Swimming mammal native to the South Pole.[16]\r\nCuttlefish — Used to make paint that is applied for ceremonial markings.[17][18]\r\nDolphin piranha — A marine animal capable of eating humans.[19]\r\nFish — Various species are typically relied on for food in the Water Tribe.[7]\r\nAnchovy[20]— A small, common ocean fish.\r\nCod flounder — A fish that can be nearly imperishable if stored correctly.[21]\r\nCommon sole — A mild fish.[22]\r\nCuttle perch – A valuable hybrid fish that travels in schools.[23]\r\nFlounder — A mild fish.[22]\r\nGiant sea crab — Crustacean considered by many to be the most delicious food in the Northern Sea.[24]\r\nHalibut[19]— A flat fish.\r\nKanpachi — A hardy, meaty, and oily fish.[25]\r\nSalmon — Fish whose meat is eaten as jerky.[26]\r\nKoalaotter — Oceanic mammal with gray fur and large ears.[27]\r\nOctopus — Cephalopod that lives in the sea.[15]\r\nPenguin sledding\r\nAang and Katara rode on two otter penguins.\r\n\r\nOtter penguin — Penguin with four flippers, used by Water Tribe people as sledges.[7]\r\nPenguin fish — Gray fish with pink fins. It has a large eye in between its gills and its mouth.[28]\r\nPolar orca[29]—An aquatic arctic mammal.\r\nPuffin-seal — Hybrid animal whose meat is made into sausages.[30]\r\nSeal — Mammal whose skin is used to build tents.[28] Its meat is eaten as jerky.[14]\r\nSea sponge — Aquatic invertebrate.[31]\r\nSea squid — Edible mollusk.[24]\r\nTiger seal — Striped brown seal.[7]\r\nTiger shark — A powerful animal that is a cross between a tiger and a shark.[32]\r\nTurtle seal — Brown seal with a hard shell, native to the North Pole.[31]\r\nWhale walrus — Creature whose blubber is used to make lamp oil.[30][23]\r\nWhale — One of the few non-hybrid animals.[33][34]\r\nTerrestrial\r\nArctic camel — A thick furred, two humped animal from the Southern Water Tribe used for transportation.[9]\r\nArctic hen — Arctic bird bred for its meat in the Northern and Southern Water Tribe; tastes similar to the possum chicken.[1][35][36]\r\nBuffalo yak — Four-legged, furry, horned mammal used for transportation.[27]\r\nIce crawler — An arctic creature adapted to cold temperatures.[28]\r\nMink snake — Lives in the South Pole; known to bite humans;[37] its fur is highly prized for its use in clothing.[38]\r\nOwl wolf — Cross between an owl and a wolf.[39]\r\nPolar bear — Non-hybridized arctic creature native to the Southern Water Tribe. Bones used in crafting weapons[40] and pelts for carpets.[24]\r\nPolar bear dog\r\nAvatar Korra is the only person known to have tamed a polar bear dog.\r\n\r\nPolar bear dog — A large, four-legged wild carnivore; it was historically feared and hunted by the Water Tribe but can be tamed.[41]\r\nPolar dog — Large dog; kept in Southern Water Tribe villages as a pet.[7]\r\nPolar leopard — White leopard that preys on turtle seals; used for clothing in the Southern Water Tribe.[42]\r\nSnow leopard caribou — Large feline used as a mount by warriors in the South Pole.[43]\r\nSnow rat — Rodent-like creature native to the South Pole; a character in local folktales.[43]\r\nWhite hamster — Small, white rodent.[7]\r\nWolf — Canine that inhabits the North[44] and South Pole. One of the few non-hybrid animals.[nb 1]\r\nYak — Large, four-legged herbivore. One of the few non-hybrid animals.[44]\r\nEarth Kingdom\r\nAquatic/semiaquatic\r\nBull frog – Horned green frog that dwells in the Foggy Swamp.[45]\r\nCatgator — Fierce reptile endemic to the Foggy Swamp and characterized by its feline barbels.[1]\r\nCrab — Crustacean that can be made into crab puffs.[46]\r\nCrab urchin — Spiky-shelled wild sea crustacean; used for cuisine.[47]\r\nCreeping slime — An \"algaelike [sic] mass that crawls up the walls of the sewers in Omashu\".[48]\r\nEel hound\r\nMaster Piandao provided Team Avatar with an eel hound to quickly reach the Fire Nation.\r\n\r\nEel hound — Amphibious four-legged creature; used for quick transportation over both land and water.[11]\r\nEel swan — An elegant animal from which many upper-class topiaries are based.[49]\r\nElbow leech — Enormous parasitic worm that attaches to elbows and feeds on human blood.[1]\r\nElephant koi — Massive oceanic koi fish.[50]\r\nFrog — Amphibian that lives in and near water.\r\nFrog squirrel — Small hybrid creature that dwells in the Foggy Swamp.[45]\r\nFlying fishopotamus — Combination of a hippo and a fish that people often ride for entertainment.[51]\r\nHippo — Large, semi-aquatic mammal.\r\nHorned toad — Large amphibian with black horns.[52]\r\nJellynemone— Cross between a jellyfish and a sea anemone. It resembles a blob of water that pulsates and floats along the current.[53] It is the secret ingredient of the Jelly Shack's famous chowder.[54]\r\nKiller shrimp — Ocean-dwelling crustacean.[46]\r\nLobster — Crustacean that can be consumed as food.[55][56]\r\nLobster crab — Crustacean that can be consumed as food in the Jelly Shack, a restaurant located in Boat Bottom.[54] There is also a species of lobster crab that glows; by the mid 170s AG, this was considered either exotic or endangered.[57]\r\nPurple pentapus — Small cephalopod with five tentacles.[58]\r\nSerpent — Large aquatic creature that inhabits the East and West Lakes[16] and is capable of dismantling a Fire Nation cruiser.[59]\r\nSe Tu fish — Large green catfish.[60]\r\nSkunk fish — Foul-smelling, oily fish.[5]\r\nTurtle duck — Duck with a protective green shell, can be domesticated and cooked.[61]\r\nUnagi\r\nThe unagi is mostly brown with a pink dorsal frill.\r\n\r\nUnagi — Enormous eel that inhabits the South Sea near Kyoshi Island.[50]\r\nWood frog — Small amphibian, can be used for medicinal purposes when frozen.[62]\r\nFlying\r\nAnt fly — Buzzing, flying insect that is known to inhabit the Lower Ring of Ba Sing Se.[63]\r\nBlue jay — Bird with blue feathers.[15][64]\r\nBumble fly — Buzzing, flying insect.[65]\r\nButterfly — Flying insect.[48]\r\nBuzzard wasp — Enormous flying insect that resides within the Si Wong Rock.[3]\r\nCat owl — Large, predatory bird with feline facial features.[46]\r\nCranefish — Noisy birds found near coastlines.[66]\r\nDove — Agile white bird.[37]\r\nDragonfly — Flying, serpentine lizard that resembles a dragon.[67]\r\nDuck — Farmed bird; often roasted.[68]\r\nFirefly — Bioluminescent flying insect.[69][70]\r\nFly — Flying small insect.[71]\r\nGiant fly — Giant bug regularly consumed by the Foggy Swamp Tribe.[1]\r\nIguana parrot — Green reptilian bird with large talons.[72]\r\nRaccoon crow — Winged creature that enjoys feeding off pumpkins.[73]\r\nRock lapwing — Bird with dun-colored flight feathers, known for laying its eggs in gravel beds.[74]\r\nFlying iguana parrot\r\nAn iguana parrot owned by the pirate captain.\r\n\r\nScorpion bee — Flying insect that gathers in large swarms and stings ferociously when aggravated.[75]\r\nScreeching dodo — White and gray bird with a shrill, piercing call.[1]\r\nSea vulture — Scavenger bird that inhabits the western coast of the Earth Kingdom.[76]\r\nSongbird — A musical bird prized by collectors in Qinchao Village.[77]\r\nSooty copper fritillary — Orange and yellow butterfly tracked by miners to uncover new mineral deposits.[78][79][64]\r\nSparrowkeet — Small, colorful bird sometimes kept as a pet.[46]\r\nSpider wasp — Cross between a spider and a wasp; known to have inhabited Yu Dao.[80]\r\nSwamp firefly — Bioluminescent fly capable of shining brighter than regular fireflies.[1][81]\r\nViper bat — Serpent-like creature with bat wings found in caves[82] that inflicts a painful sting.[83]\r\nWolfbat — Large, snub-nosed bat that resides within the Cave of Two Lovers.[68]\r\nTerrestrial\r\nAnt — Small insect that lives in large colonies.[55][84][77]\r\nArmadillo lion — Cross between an armadillo and a lion that rolls up when tensed.[85][86]\r\nBadgermole\r\nBadgermoles have facial stripes that resemble those of a badger.\r\n\r\nBadgermole — Enormous, subterranean blind mammals; the original earthbenders.[68]\r\nBear — Large brown, non-hybrid mammal known to hibernate; extremely rare.[46][87]\r\nBeetle worm — Worm and beetle hybrid that is occasionally used as an ingredient in soup.[82]\r\nBoar — Wild mammal hunted for food in forested regions.[88]\r\nBoar-q-pine — Large wild boar covered in sharp, detachable spines.[6]\r\nBull shark — Cross between a bull and a shark.[39]\r\nCabbage slug — Small yet destructive agricultural pest.[16]\r\nCamelephant — Four-legged mammal with a long nose; used for transportation.[89]\r\nCanyon crawler — Insectoid, six-eyed, omnivorous creatures native to the Great Divide.[2]\r\nCat — There are numerous subspecies of cats, including a fluffy white tabby with green eyes, slim beige cat with patches of brown, and a bearded feline.[62][90][67]\r\nChameleon — Small, color-changing lizard with yellow eyes and a crest on its head.[42]\r\nChicken — Flightless bird bred for meat and eggs.\r\nCrococat — Domesticated feline with the scaled back and abdomen of a crocodile.[91]\r\nDeer dog — Domesticated canine with antlers found in the Si Wong Desert.[92]\r\nDog — Largely domesticated four-legged mammal.[93]\r\nDove-tailed deer[94]\r\nElephant — Large terrestrial mammal known for its oversized ears.[79]\r\nElephant mandrill — Mandrill and elephant cross.[67]\r\nElephant rat — Black rodent with a large snout.[42]\r\nPabu about to comfort Korra\r\nPabu is a fire ferret owned by Bolin.\r\n\r\nFire ferret — Red arboreal mammal common to bamboo forests.[95]\r\nFox antelope — Horned four-legged herbivore with a tail.[46]\r\nGecko — A small lizard able to quickly scale walls; inspiration for the Earth Rumble fighter of the same name.[96]\r\nGemsbok bull — Stocky brown animal with large horns.[67]\r\nGiant night crawler — Giant worm.\r\nGiant rhinoceros beetle — Giant beetle; used for transportation.[6]\r\nGilacorn — Small desert-dwelling, egg-stealing lizard.[6]\r\nGlowworm — Bioluminescent bug kept in jars as a light source.[97]\r\nGoat dog — Small, shaggy, white canine kept as a pet.[67][98]\r\nGopher — A burrowing rodent; inspiration for the Earth Rumble fighter of the same name.[99]\r\nGopher bear — Cross between a gopher and a bear.[46]\r\nGoat gorilla — Aggressive primate which inhabits secluded mountains and woodland; are sometimes held in captivity and tamed.[90]\r\nHermit marmoset — Chimerical creature with a strong shell that can last for centuries, which is often collected by shell connoisseurs.[100]\r\nHog monkey — Forest-dwelling primate with a squashed face.[88]\r\nHopping llama[101]\r\nHoppy possum — Cross between a frog and a possum.[48]\r\nHybrid pigs — Includes the wooly-pig, moo-sow, picken, pigster, pig deer, bull pig, and pig chicken.[102][103]\r\nJackalope — Jackrabbit with large antlers.[6]\r\nLeech-a-pillar — Leech and caterpillar cross.[48][104]\r\nLop-eared rabbit — Nimble rabbit with long, drooping ears.[90]\r\nLlama-paca — Cross between a llama and an alpaca.[105] Its wool is strong, warm, and flame resistant.[106]\r\nMeadow vole — Small white rodent.[15]\r\nOstrich horse\r\nOstrich horses are a common method of transportation in the Earth Kingdom.\r\n\r\nMonkey — Small primate used for street dancing shows in Ba Sing Se.[67]\r\nOstrich horse — Large brown bird commonly used for transportation.[107]\r\nOwl wolf — Cross between an owl and a wolf.[39]\r\nPlatypus bear — Bear with a large bill and flat tail; lays edible eggs.[60]\r\nPoodle monkey — Domesticated simian pet.[67] As a result of efforts to make individuals look more pleasing to the eye, the most inbred members of the species inherit detrimental health effects, such as miniaturized snouts that cause breathing problems.[108]\r\nPossum chicken — Bird hunted in the Foggy Swamp; tastes similar to arctic hen.[1]\r\nPrickle snake — Serpentine creature which is known to hide in sleeping bags, posing a danger to its occupier.[14][109][104]\r\nPygmy puma — Smaller and sleeker species of puma bred for and adapted to living in a compact city environment.[67]\r\nQuilled chameleon — Reptile found in the densely forested regions.[42]\r\nRabaroo — Cross between a rabbit and kangaroo; young rabaroos are nurtured in their mothers' pouch.[67][104]\r\nSaber-tooth moose lion — Moose and lion cross; cubs are not aggressive, but mature females are protective of their young.[110]\r\nSand shark — Massive shark-like predator that inhabits the inner regions of the Si Wong Desert.[111]\r\nScorpion — Venomous arachnid found in the Si Wong Desert.[3][108]\r\nShirshu — Large, eyeless mammal with a pink, star-shaped nose; has a keen sense of smell used for tracking and navigation.[15]\r\nSilkpillar — Cross between a silkworm and a caterpillar. They are of great economic value as a producer of silk.[112]\r\nSinging hogs\r\nSinging groundhogs can imitate musical notes and even human speech.\r\n\r\nSinging groundhog — Small, brown, and furry rodent with a musical call.[93][109]\r\nSkunk bear — Cross of a skunk and a bear.[46]\r\nSour beetle — Only creature in the Si Wong Desert the giant gilacorn would not eat. According to legend, the headpieces worn by beetle-headed merchants were crafted to mimic the appearance of a sour beetle, an intuitive trick that allowed the tribesmen to deceive gilacorns and avoid being attacked.[113]\r\nSpider — Eight-legged arachnid capable of quickly weaving a web.[42][114]\r\nSpider ant — Cross between a spider and an ant.[115]\r\nSpidersnake — Ten-eyed chimerical creature known to inhabit the Earth Kingdom. Cross between a spider and a snake. Its extract, very rare and expensive, can be used to change one's eye color.[116] \"Killing two spidersnakes with one stone\" is a saying that involves the creature.[117] In gambling, rolling two fives on a pair of dice is known as \"spidersnake eyes\".[102]\r\nSquirrel mouse — Cross between a squirrel and a mouse. They are usually found in closed spaces, such as storage rooms.[118]\r\nStag beetle – Giant animal used as a mount.[119]\r\nSugar glider — Small mammal indigenous to forests. It has membranes between its legs that enable it to glide.[52]\r\nTigerdillo — A hybrid between a tiger and an armadillo;[67][104] known for its roar[120] and defensive nature.[121]\r\nTurkey duck — Turkey and duck hybrid.[60]\r\nTurtle — Reptile with a body encased in a shell. Statues of turtles can be found on the path leading to Mt. Makapu.[122]\r\nWorm — Subterranean invertebrate that consumes decaying plant and animal matter.[109][70]\r\nFire Nation\r\nAquatic/semiaquatic\r\nBadgerfrog — Green and brown frog with a trim of white fur.[123][124]\r\nBangus fish — A type of fish native to the waters of Lambak Island.[125]\r\nClam — Mollusk found in the Jang Hui River; outer shell blisters when its environment is ravaged by water pollution.[126]\r\nCoral urchin — A cross between a coral and a sea urchin; inspiration for the Coral Urchin Noodle Shop.[127]\r\nCrab — A crustacean found along island shorelines like those of Lambak Island.[128]\r\nCricket goose — An edible goose species, cross between a cricket and a goose.[129]\r\nCucumber sponge — Known to inhabit the waters of the Mo Ce Sea. They are prized creatures for their value in open market after being carefully killed and dried, as nobles wash their faces with their cured exteriors in order to soften their skin.[130]\r\nFlying dolphin fish\r\nFlying dolphin fish can be found jumping out of the waters alongside boats before the coast of the Fire Nation.\r\n\r\nFlying dolphin fish — A cross between a dolphin and a flying fish; can be ridden for recreational purposes.[131][104]\r\nIguana seal — Green aquatic reptile characterized by its unusual call.[89]\r\nLimpet — A group of aquatic snails with a conical shell shape.[132]\r\nManatee whale — Large aquatic mammal used to tug boats over the sea.[133]\r\nMudfish — A type of fish native to the waters of Lambak Island.[134]\r\nNight abalone – Marine snail found in the Mo Ce Sea; known for producing unique black pearls on extremely rare occasions.[135]\r\nReefcrab — Known to inhabit jagged rocks along the southern coastline of Shuhon Island. Local birds prey upon reefcrabs when there is no refuse to eat.[29]\r\nSea slug — Large slug sometimes cooked for food.[136]\r\nSea snail - An aquatic animal endemic to Lambak Island from which crimson ink can be extracted.[137]\r\nShrimp — Can be used to make shrimp flakes.[138]\r\nSilverskim fish — A migrating fish drawn to areas of heavy rain and caught in nets.[139][104]\r\nStarfish — Marine invertebrate with five radial appendages.[120][100]\r\nTurtle crab — Crab with a protective turtle shell.[80]\r\nTurtle duck — Duck with a protective green shell.[102]\r\nTwo-headed fish — Mutated fish spawned by the contamination of the Jang Hui River.[126]\r\nFlying\r\nCicada beetle — Cross between a cicada and a beetle.[140]\r\nCicada cricket — Cross between a cicada and a cricket.[38] Some take up cicada cricket fighting as a hobby.[141]\r\nDragon — Large, flying reptile with a long body; the original firebenders.[107]\r\nEagle hawk — Cross between an eagle and a hawk.[142][143]\r\nFirefly starling — Cross between a firefly and a starling; indigenous to Lambak Island. A single flock can consist of a thousand firefly starlings. During the night, the creatures move together in unison while emitting pulses of bioluminescent light, resembling constellations of stars shifting in the sky.[134][144] In mating seasons, the males of the species make a series of rapid squawks to attract a mate.[145]\r\nFlutter bat — A large bat found in the Fire Nation; it is a cross between a bat and a butterfly or a moth.[146][147]\r\nHawk — Non-hybridized hawk.[80]\r\nLion vulture — Vulture and lion cross.[6]\r\nHawky\r\nA dragon hawk was, at one point, owned by Sokka.\r\n\r\nDragon hawk — Non-hybridized bird of prey with dark red or brown feathers and a lighter underside. It is used to deliver messages.[148]\r\nRaven eagle — Predatory[63] avian animal with crooked claws[149] that can be trained to intercept dragon hawks.[133]\r\nSea raven — Stylistically depicted in the emblem of the Southern Raiders.[150]\r\nToucan puffin — Sea bird with a large yellow bill.[89]\r\nValley dove – Bird with rapid low coos; lives in the valley on Lambak Island.[151]\r\nTerrestrial\r\nAardvark sloth — Used in the Sun Warriors' ancient city to clean off slime.[152]\r\nArmadillo bear — Large bear with a hard, segmented shell.[153]\r\nBark beetle — Insects with the capacity to severely infest woodland areas. Native to Lambak Island.[154]\r\nBasilisk centipede - A bright red insect that when threatened excretes a slime stored within its glands that paralyzes a victim upon first touch. The insect is about the width of a hand and endemic to Lambak Island.[155]\r\nCat — Domesticated feline kept as a pet.[142]\r\nCavehopper — White arthropod with four legs.[89]\r\nDragon moose — Used for pulling carriages.[148]\r\nEarthworm — A burrowing invertebrate that feeds off organic matter in the soil and is enjoyed by pig chickens; distinguished by the raised band, or clitellum, located near the head of the body.[142]\r\nElephant rat — Elephant and rat cross.[156]\r\nGhost spider - The ghost spider is an arthropod which unlike most spiders traps its victims through hanging from canopies rather than using webs. When it drops down and sinks its fangs into the prey, a paralyzing venom is injected, turning the victim's organs to mush without killing it. The spider then easily feeds it babies utilizing the mushed innards after dragging the prey back to the nest.[151]\r\nGorilla tarsier - A gorilla and tarsier hybrid that is typically used as a mount. They are known to be able to climb trees as well as walk on land. While they are generally docile herbivores, they can turn aggressive if someone they have not accepted attempts to mount them. They are endemic to Lambak Island.[134][157]\r\nHippo cow — Domesticated omnivorous mammal with black spots.[89]\r\nHippo ox — Eaten as a delicacy.[158]\r\nHog monkey – Forest-dwelling primate.[151]\r\nHybrid pigs — Domesticated animals that are basis of agriculture usually in rural areas.[103][142][159]\r\nKoala sheep — Koala and sheep hybrid.[160]\r\nKomodo chicken — A cross between a komodo dragon and a chicken; can be consumed as food.[89]\r\nKomodo rhino — Ferocious creature characterized by its versatility and ability to function over many different types of terrain; it is therefore useful as a cavalry mount, but is also used to make komodo sausages.[50]\r\nMaggot slug — A cross between a maggot and a slug.[142]\r\nMongoose lizard — Mongoose and basilisk lizard cross used for transportation.[64]\r\nPuma goat — A cross between a puma and a goat.[161][162]\r\nRat snake – Hybrid animal with a pale underbelly; found on Lambak Island.[145]\r\nSnail sloth — Cross between a snail and a sloth and the slowest creature in the world.[163]\r\nSquirrel toad — A small forest dwelling animal, it is a cross between a squirrel and a toad.[146][162]\r\nTiger monkey — Hybrid of a tiger and a monkey.[164]\r\nUnited Republic of Nations\r\nAquatic/semiaquatic\r\nFish — Aquatic fauna found in the ponds of Avatar Korra Park.[165]\r\nStarfish — Marine invertebrate with five radial appendages.[166]\r\nSquid — Aquatic fauna found at the shores of Republic City.[167]\r\nFlying\r\nDragonfly hummingbird — a flying creature with the head, legs, and chest of a hummingbird, while sporting the wings, scales, and tail of a dragonfly. It can fly in any direction, which gave Asami Sato the idea to design a flying mecha suit after its image.[168]\r\nLizard crow — Lizard and crow cross that lives in urban areas.[169]\r\nPeli-puffin — Sea bird with a large yellow bill.[166]\r\nRing-tailed winged lemur — Flying mammal found on Air Temple Island; closely related to the winged lemur.[170]\r\nRooster pigeon — Sits on the telephone wires in Republic City, especially by the docks.[171]\r\nTerrestrial\r\nCat — Domesticated feline kept as a pet.[159]\r\nElephant rhino — Elephant and rhinoceros hybrid.[32]\r\nMonkey marmot — Hybrid animal with a reputation for stubbornness; according to Varrick they cannot be forced to do anything.[171]\r\nPoodle pony — Cross between a poodle and a pony.[65]\r\nPythonaconda — Cross between a python and an anaconda.[172][104]\r\nSandmole — Beach critter known to steal towels and avoid the smell of garlic.[166]\r\nSpider rat — Lives within the houses of Republic City and is considered to be an urban pest.[173][174]\r\nWeasel snake — Weasel and snake hybrid.[95]\r\nSpirit World\r\nAquatic/semiaquatic\r\nCatgator spirit — Reptile living in aquatic regions of the Spirit World, which can grow much larger than its counterpart from the natural world, and has spiritual abilities.[175][176]\r\nKoi fish — Physical manifestation of the spirits Tui and La, who correspond with the Moon and Ocean, respectively. Two fish are found in the Northern Water Tribe's Spirit Oasis, one of which is primarily white and the other black. They continuously swim in a circle, performing an eternal dance of push and pull.[177]\r\nFlying\r\nDragon bird spirit — Dragon and bird cross; known to nest on Hai-Riyo Peak.[175]\r\nDragonfly bunny spirit — Colorful, bunny-like spirits capable of flight.[178]\r\nMoth wasp — Moth and wasp cross; the wolf spirit has the ability to breathe these.[103]\r\nSpirit World firefly — Bioluminescent insect.[177]\r\nTerrestrial\r\nCurly-tailed blue nose — Primate with brown fur.[177]\r\nForest spirit — Supernatural entity that watches over the forested regions of the northwestern Earth Kingdom.[179]\r\nGiant wolf — Creature identical to an actual wolf with the exception of its gargantuan size.[177]\r\nCalm Hei Bai\r\nWhen calm, Hei Bai appears in panda form.\r\n\r\nHei Bai — Guardian spirit of a forest that normally assumes the form of a panda bear, but transforms into an aggressive monster with six limbs when enraged.[107]\r\nKnowledge Seekers — Foxes that assist the knowledge spirit, Wan Shi Tong.[93]\r\nMeerkat prairie dog spirit — A cross between a meerkat and a prairie dog.[175]\r\nWolf spirit — Spirit living near Hira'a. It is extremely large and has the ability to breathe moth wasps.[103]\r\nOthers\r\nAquatic/semiaquatic\r\nBarnacle — Marine crustacean that attaches itself to a variety of surfaces, such as the keels of ships.[116]\r\nCoral — Marine invertebrates that live in compact colonies and produce secretions that form a hard skeleton over many generations, resulting in the creation of large reef structures.[180]\r\nCrocodile frog — Cross between a crocodile and a frog.[93]\r\nFrigatern — Grey-plumed, predatory seabird that resides in the archipelagos of the Mo Ce Sea.[181]\r\nGoose eel — Cross between a goose and an eel, this amphibious creature has vivid purple feathers.[74]\r\nMeerpenguin — Cross between a meerkat and a penguin.[182]\r\nSeal snake — Cross between a seal and a snake.[183]\r\nShark squid — A cross between an squid and a shark that is considered powerful and scary.[19][98]\r\nStingjelly — Cross between a stingray and jellyfish. It produces a sticky-sweet-smelling venom that is used in poison training, as it immobilizes the body to near paralysis and disorients the senses.[184][185]\r\nSwan — A bird. Its appearance at the bottom of a cup of tea symbolizes good luck and a new love.[186]\r\nTiger orca — Cross between a tiger and an orca. Considered to be deadly creatures.[98]\r\nWhale dolphin — Large aquatic creature resembling the submarines developed by the mechanist.[187][188][189]\r\nWinged eel — Known to inhabit the Mo Ce Sea and travel in schools.[180]\r\nFlying\r\nAlbatross — A rare bird found nesting on Razor Reef.[74]\r\nBunch hornet — A type of flying insect that disguises itself as fruit.[190]\r\nFlying boar — Symbol of the Beifong family.[55]\r\nGullguana – Cross between a seagull and an iguana. The Crimson Sails airship was called the Listing Gullguana.[191]\r\nHummingfly — A quick, winged insect.[192]\r\nMosquito leech — Cross between a mosquito and a leech.[193]\r\nMoth — An insect drawn to light and known to cause damage to some cloth materials, such as tents.[94][194]\r\nOpossum bat — Cross between an opossum and a bat, often used as an idiom (\"playing opossum bat\") to describe when someone is feigning defeat, death, illness, etc.[153]\r\nPeacock pigeon — Cross between a peacock and a pigeon that lived during Wan's time.[190]\r\nRobin fly – A full circle Pro-bending tournament is called a \"round robin fly\".[195]\r\nTerrestrial\r\nAngler termite — Cross between an angler and a termite that forms colonies in vast complex mounds.[196]\r\nCat deer — Cross between a cat and a deer; it can be domesticated and is large enough to be ridden.[197]\r\nChicken lizard — Cross between a chicken and a lizard.[161]\r\nCricket snail — Cross between a cricket and a snail.[198] They are used by gamblers in snail-fighting.[199]\r\nDeer fox — Cross between a deer and a fox. Unique to Jasmine Island.[200]\r\nFalconfox — Cross between a falcon and a fox, comprising a beak, feathers, and four legs.[201]\r\nHorse bug — Cross between a horse and an insect; used as an idiom (\"looked like you swallowed a horse bug\") to describe when someone is acting unnerved.[202]\r\nJaguar beetle — An insect that lives in mounds created by angler termites after they have moved on to form other colonies.[196]\r\nLion elephant — Cross between a lion and an elephant.\r\nLion turtle drawing\r\nThe lion turtle is much larger in size compared to a human.\r\n\r\nLion turtle — An ancient species that can grow to immense sizes. Vegetation will occasionally sprout on its back, and cities are sometimes built on its shell.[93][190]\r\nLizard mouse — Creature known for its silent behavior.[203]\r\nPheasant squirrel — Cross between a common pheasant and a squirrel.[204]\r\nRabbit monkey — Cross between a rabbit and a monkey.[205] Pu-on Tim mistook Momo for a flying version of this creature in his play based on Avatar Aang's life, The Boy in the Iceberg.[206]\r\nRat pig — Cross between a rat and a pig. Used as an insult.[207]\r\nRhino lion — Cross between a rhinoceros and a lion.[32]\r\nSkunk squirrel — Cross between a skunk and a squirrel that lived in Wan's time.[190]\r\nSlug — A shell-less gastropod mollusk described as resembling a blob.[108]\r\nSloth mouse — Cross between a sloth and a mouse. A restaurant in Republic City is called The Sleeping Sloth Mouse.[208]\r\nSnail — A shelled gastropod mollusk described as slow-moving.[77]\r\nSpider cat — Hybrid creature with brown fur.[93][209]\r\nStoatweasel — Cross between a stoat and a weasel with a reputation for being sneaky.[210]\r\nTea weevil — A type of beetle that can damage tea crops.[211]\r\nTick — Parasitic arachnid that feeds off the blood of other animals. It can transmit Lyme disease.[212]\r\nTwo-headed rat viper — Venomous snake with two heads.[150]\r\nVine cobra — A type of spitting animal.[213]\r\nViper — A type of snake.[214][215]\r\nWalrus yak — Cross between a walrus and a yak.[93]\r\nWebbed leopard — Known to ambush prey by dropping out of trees.[216]\r\nWoodpecker lizard — Cross between a woodpecker and a lizard that lived during Wan's time.[190]\r\nZebra frog — Cross between a zebra and a frog.[209]"
}