{
  "name": "republic city food data",
  "description": "United Republic of Nations\r\nRepublic City cuisine\r\nConsumers in Republic City are able to enjoy a variety of foods from around the world.\r\n\r\nThe often fast-paced sense of life in the United Republic of Nations has given rise to commercially prepared foods, such as instant noodles and snack cakes. Many citizens find it convenient to eat meals in a hurry, and have meals from workplace cafeterias, or from street food carts.[208][209] The rise of large corporations in the nation has even led to there being restaurant chains under shared franchising agreements, which compete with the traditional small, independent eateries.[210]\r\n\r\nMost of the United Republic's gourmet cuisine are adaptations of dishes from the other nations. The cosmopolitan sense of life in the nation has led to a variety of world fusion dishes, such as traditional Earth Kingdom dishes being adjusted with Fire Nation spices.[211]\r\n\r\nCommon ingredients\r\nBread — Can be made from flour.[212]\r\nCherries[108]\r\nChili pepper — A hot, red pepper believed by Varrick to increase brain circulation if eaten whilst hung upside down.[213]\r\nEggs[214]\r\nGarlic[215]\r\nJellynemone[216]\r\nKarashi — A condiment or seasoning imported from the Fire Nation. Unfamiliar to some United Republic citizens, but well-known to many home cooks.[187]\r\nLemon[213]\r\nLobster crab[216]\r\nMint[213]\r\nMolasses — A viscous substance refined from sugar that can be stored in barrels and used as a sweetener.[214]\r\nPotatoes[94]\r\nRice — A staple crop.[217]\r\nSesame[217]\r\nSugar[214]\r\nWasabi — A spicy condiment.[215]\r\nDishes\r\nBeef jerky — Small meat snack.[218][219]\r\nCrispy squid balls – A famous dish served in a popular seafood restaurant.[220]\r\nCupcakes — Small pastries topped with icing and cherries.[221]\r\nDumplings — Usually made from flour or rice.[222][223]\r\nFlamey-O Instant Noodles — A convenient dish known for its quick preparation time. Shiro Shinobi advertised the product over the radio during a pro-bending match, calling them \"the noodliest noodles in the United Republic\".[224]\r\nLobster crab chowder — The Jelly Shack's famous chowder, which secret ingredient is jellynemone.[216]\r\nOctopus fritters — Served as an appetizer.[97]\r\nPepper jelly[215]\r\nPopcorn — Sold at the Pro-bending Arena.[225]\r\nRamen — Noodle soup prepared in a variety of ways.[210]\r\nRoasted meat on sticks — When Korra and Naga arrived in Republic City and sought out food, the first place they came across was a stall selling various kebab-like snack foods, though they had no money to pay for them.[226]\r\nRock crab soufflé — Considered a delicacy.[227]\r\nSeaweed noodles — A dish typically from the Southern Water Tribe. It is sold at Narook's Seaweed Noodlery.[2][224]\r\nSesame-dried sticks — A starchy snack.[217]\r\nSpicy bean cakes — Supposedly enjoyed by peli-puffins.[215]\r\nSpicy pickled kelp — Considered a delicacy.[227]\r\nStrawberry pie — Pie made with strawberry filling.[228]\r\nStreet gruel — A common meal among the homeless population of Republic City. Made from the contents of the city's various dumpsters.[229]\r\nTurkey duck skewers – Greasy dish.[230]\r\nTurtle crab noodles — A dish with turtle crab meat.[231]\r\nVarri-cake — A type of snack cake made and distributed by Varrick Global Industries. It contains a red filling, topped with white icing.[232]\r\nBeverages\r\nCherry-berry lemonade — A refreshing drink made from squeezed cherries, berries, lemon juice, water, and sugar.[108]\r\nCucumber-aloe water — A mixture of aloe vera and water, served with two cucumber slices.[97]\r\nSmoothie — A drink made up of various fruits blended together.[233]\r\nSoda water — Carbonated water, which can also be used to remove stains from clothes.[234]\r\nTea — Made from a variety of leaves in hot water.[235]\r\nWatermelon juice — A refreshing beverage consumed on hot days.[236]"
}