{
  "name": "fire nation food data",
  "description": "Fire Nation\r\nFire Nation food\r\nThe Fire Nation also carries a wide variety of food offerings, much like the Earth Kingdom.\r\n\r\nThe defining characteristic of Fire Nation cuisine is its spicy nature,[153] and Fire Nation citizens are known to put spices into many of their delicacies and treats. The Fire Nation uses a wide variety of grains, meats, and vegetables in cooking.\r\n\r\nCooking style\r\nAs with the Earth Kingdom, many cooking methods are utilized in the Fire Nation, with an extensive variety of food types available; regional variation is smaller, however, due to the size of the nation. Boiling is used for rice and many vegetables, while fish and meats and generally steamed and roasted, respectively. Like the Earth Kingdom, baking is used extensively to make cakes, buns, and tarts, though the Fire Nation also has many snack foods, typically in the form of roasted bite-sized pieces with a large number of spices. Chili and other spices are added to nearly all savory food.\r\n\r\nMuch of the Fire Nation food is based on control and respect for firebending. Bending coals, for example, just hot enough to toast a dish but not set it alight is not just a demonstration of skill, but also a way to show appreciation and connection to their nation itself.[153]\r\n\r\nCommon ingredients\r\nGrains\r\nBeans — Cooked in pots during the Festival of Szeto to represent the inventories being counted.[154]\r\nFlour — Made from wheat into buns and dumplings.\r\nMillet — Toasted for use as a travel snack.[154]\r\nRice — A staple food, usually boiled.[2][155]\r\nSorghum[156]\r\nWheat — A staple food, made into flour.[157]\r\nFish and meat\r\nBangus fish — Usually fried.[158]\r\nClam — Usually boiled.[159]\r\nCrab[34]\r\nDuck — Usually roasted.[139][160]\r\nElephant rat — Eaten during survival training at the Royal Fire Academy for Girls.[86]\r\nEgg[161][162]\r\nFish — Usually steamed with garnish applied.[163]\r\nSilverskim fish — A migrating fish drawn to areas of heavy rain and caught in nets.[164]\r\nHippo-ox[156]\r\nKomodo chicken — Usually roasted. In 100 AG, Zuko took a box of komodo chicken to his uncle, Iroh, during his imprisonment in the Capital City Prison.[165][166]\r\nKomodo rhino — Traditionally made into sausages and served at picnics and sporting events,[66][167] but can also be made into steaks and jerky.[136][168]\r\nMudfish — A fish indigenous to Lambak Island. Used in stews.[169]\r\nSea slug — Usually smoked.[170]\r\nShrimp — Can be used to make shrimp flakes.[171]\r\nSquid — Usually fried.\r\nFruits, vegetables, and fungi\r\nApple — Grown on trees; can be bought at the market in Fire Fountain City.\r\nAsh banana\r\nAsh bananas are grown on Hing Wa Island.\r\n\r\nAsh banana — Brownish-yellow fruit that can be baked into a bread.[66][172]\r\nBanana[173]\r\nCabbage — Usually boiled, stir-fried, or left uncooked and used as a garnish.[2][155]\r\nCherries — Used to make ice cream in Ember Island.[174][175]\r\nChili — Used extensively for almost any type of dish or served whole; found stir-fried, boiled, and in salads.[163] Eating chili helps firebenders bring out their bending talents. Nurturing the special Fire Nation chili plants is a revered practice.[153]\r\nDragon paw fruit – Sweet and juicy fruit with a spiny shell.[176]\r\nDumpling weed — Found in some parts of the Boiling Rock's prison complex and used by prisoners to supplement their rations.[99]\r\nFigs[177]\r\nLychee nut — Small reddish-brown fruit that can be used to make tea or juice.[2][155]\r\nLemon[170]\r\nLettuce[165]\r\nMango[178]\r\nMelon[179]\r\nMelonyam[180]\r\nMushroom[156]\r\nOcean kumquat[66]\r\nPeas[99]\r\nPink berries\r\nPlum[156]\r\nPurple berries[159]\r\nScallion[181]\r\nStar apple – Fruit with toxic skin and edible flesh.[182]\r\nTamarind — A legume.[183]\r\nTomato[162]\r\nTomato-carrot[184]\r\nWakame[185]\r\nWatermelon[186][187]\r\nOther\r\nBrine — Water strongly impregnated with common salt used to pickle food.[167][185]\r\nJelly — A semisolid substance typically made from fruit juice and sugar that can be spread on toast.[188]\r\nKarashi — An iconic condiment or seasoning, considered \"Fire Nation mustard\".[187]\r\nOil[181]\r\nSalt — A mineral used as a food preservative and flavor enhancer, procured along the shore of Shuhon Island, near Fire Fountain City.[154]\r\nSugar[154][153]\r\nTogarashi — A spice mixture.[189]\r\nDishes\r\nBean cakes — Snack food.[190]\r\nBuns and bread — Can be made from flour.[84]\r\nChicken skewers — The \"Roku style\" skewers are prepared with spicy oil and scallions.[181]\r\nCookies — Snack food.[190]\r\nDried mushrooms[191]\r\nDumplings — Dough filled with meat and/or vegetables.\r\nElephant Koi Shui Zhu Yu — Fish fillet poached in seasoned water and topped with Fire Nation spices. Prepared in the Earth Kingdom's Yokoya, this was Hei-Ran's favorite dish.[35]\r\nFertilized turtle duck egg — Sometimes eaten as a snack by nobility in the Capital.[192]\r\nFire cakes — A spiced pastry.[155]\r\nFire gummies — Snack food.[193]\r\nFlaming fire flakes — Snack food; spicy flakes that are roasted.[92][95][193][194] Several variations exist.[171]\r\nFried bangus fish — A dish that was part of the Lambak clan's celebratory feast to mark the autumn equinox.[158]\r\nFried egg — A dish that was part of the Lambak clan's celebratory feast to mark the autumn equinox.[158]\r\nFruit tart — Dessert. It can be served with rose petals on top.[8][28]\r\nGruel — A breakfast item at the Fire Nation Royal Palace, typically served bland with spices and oils on the side to be added to taste.[195]\r\nHippo-ox tail skewers[196]\r\nHotcakes — Pastry. Sometimes used for birthday celebrations.[174]\r\nIce cream — Frozen cream, eaten in waffle cones. Served in Ember Island.[163][175]\r\nKomodo chicken — A dish that Iroh and Zuko used to steal from the Fire Nation palace kitchen.[197]\r\nKomodo chicken skewer — Roasted meat on a stick.[198]\r\nSpiced komodo chicken sausage — A dish that was part of the Lambak clan's celebratory feast to mark the autumn equinox.[158]\r\nKomodo jerky — Jerky made from komodo rhino meat.[168]\r\nKomodo kabob — Popular dish with Fire Nationals.[10]\r\nKomodo sausage — Sausage made from komodo rhino meat.[66]\r\nLoco moco – Traditional dish of Hira'a.[199]\r\nMochi — A chewy rice cake, may be prepared for birthday celebrations.[116]\r\nMudfish stew — A dish passed down through the Lambak clan.[169]\r\nNoodles[2][155]\r\nSpicy noodles — Can be eaten for breakfast with an onsen egg.[161]\r\nExtra spicy fire noodles[8]\r\nSpiral-shaped noodles — Traditional food eaten to celebrate a new Fire Avatar being announced to the world.[200]\r\nNoodle soup — Soup with noodles and seafood.\r\nUdon noodles[201]\r\nOnsen egg[161]\r\nRice[2][155]\r\nRice ball[168]\r\nRice candy — Snack food.[190]\r\nRoast duck — Duck that is seasoned, roasted, and cut into bite-sized pieces.[139][160]\r\nSalted vegetables — A breakfast item at the Fire Nation Royal Palace, served alongside gruel.[195]\r\nSea soup — Soup with seafood and eggs.\r\nSizzle-crisps — Snack food, probably made from meat.[92] Zuko's favorite afternoon snack.[189]\r\nSmoked sea slug\r\nSmoked sea slug can be found at a café in Shu Jing.\r\n\r\nSmoked sea slug — Common dish enjoyed by middle and upper class.[170]\r\nStalknose mushrooms — A traditional Festival of Szeto dish, symbolic of good harvest due to growing on overcrowded ears of grain.[196]\r\nSuperspicy soufflé — Specialty of Kirachu Island.[202]\r\nTart pie — Pie with fruit tart on top.\r\nTea sandwich — Small prepared sandwiches.[203]\r\nToast — Sliced bread that is browned or cooked by exposure to radiant heat and can be enjoyed with condiments such as jelly.[188]\r\nBeverages\r\nAzula's Lightning — A spicy, cold beverage.[204]\r\nJuice — A cold drink with a slice of fruit.[170]\r\nPlum wine – A blazing alcoholic beverage that causes a burning sensation in the throat.[156][205]\r\nSorghum liquor — A strong alcoholic beverage.[156]\r\nSweetened beverage — A dark, sugary drink sold during the Festival of Szeto to symbolize the prodigious amount of ink Avatar Szeto used over his career.[154]\r\nTea — Made from a variety of leaves in hot water. There are many varieties. The type drunk in the homeland is Fire Nation spiced tea, mainly by commoners, but nobles may have it as well. They also enjoy jasmine and ginseng tea, and tea leaf juice.[2][147][155][206]\r\nThe Firebending Masters — A soothing and spicy cleansing tonic to drink before firebending practice. It was named by Iroh in honor of the Sun Warriors.[204]\r\nWatermelon juice — A naturally occurring beverage consumed on especially hot days or at the beach. The deep pink liquid can be drunk by cutting a hole in the top of a watermelon and sucking it out using a straw fashioned from a bamboo shoot.[186][207]\r\nOther\r\nSweet cream — Served with hotcakes.[174]"
}