{
  "name": "air nation food data",
  "description": "Air Nomads\r\nAir Nation cuisine\r\nAir Nomad cuisine consists of strictly vegetarian meals.\r\n\r\nMuch of the culinary traditions of the Air Nomads were lost after their civilization was nearly wiped out at the beginning of the Hundred Year War. However, it is known that the most defining characteristic of their cuisine was strict vegetarianism,[1] and they were also known for their sweets, such as fruit pies and custard tarts,[2] as many monks were skilled bakers.[3] In keeping with their traditional philosophy of non-violence and not harming the environment, the Air Nomads cultivated their own food in ways that caused the minimal environmental impact.[4] Following the Hundred Year War, Avatar Aang attempted to reconstruct some of the Air Nomad cuisine from memory as well as based on scrolls he found in the air temples. However, as the documents were often badly damaged and nearly illegible, and he had been no professional cook, he was forced to improvise.[5] Regardless, he hoped that his work would help to keep some elements of Air Nomad culture alive and to carry on the philosophies of their cooking. While many of the particular vegetables and fruits that once grew in abundance among each temple's peaks were gone, the Avatar attempted to recreate certain items with available substitutes in the Earth Kingdom and the Fire Nation. For this task, Aang requested Toph Beifong's aid to revitalize the nomads' stone ovens.[6]\r\n\r\nCooking style\r\nThe Air Nomads' cuisine was not just about sustenance, but also about having fun with their airbending ingredients and with each other. The monks would usually prepare treats with expert airbending and teach that a tasty meal cannot be constructed with ingredients that have not been properly loved and taken care of, as cooking starts from the seed and all the way until the food ends up on the plate.[6] The Air Nomads were known to be skilled at baking[7] and steaming.[8] They are also known to not use much salt or spices in their food.[9][10] While they primarily used ingredients found at the temples, they also experimented with flavors and ingredients from across the nations, such as their sweet rice, which they could adapt to any fruits and nuts in order to prepare during their travels.[11]\r\n\r\nCommon ingredients\r\nDairy\r\nButter — Made with milk. Used for butter tea.[12]\r\nCream — Used as a dessert topping.[13]\r\nCustard — Used in baked goods, such as egg custard tarts.[1][14]\r\nEgg — Used in baked goods, such as egg custard tarts.[1]\r\nMilk — Used in dumplings.[15] As the nomads lived in high altitudes, they always kept a steady supply of milk.[12]\r\nFlavorings, herbs, and spices\r\nChives[16]\r\nCilantro — Used as a garnish.[5]\r\nGarlic[5]\r\nGinger — Used in dumplings.[15]\r\nMaple syrup[17]\r\nVanilla[17]\r\nFruits, vegetables, and fungi\r\nApple — Edible fruit produced by an apple tree. Used for salad.[18][19]\r\nBanana — Used for juices.[20][21]\r\nBean sprouts — Consumed during Yangchen's Festival.[9]\r\nBird's eye chili[5]\r\nCabbage — Used in dumplings.[15]\r\nCarrot — Used in dumplings.[15]\r\nChayote — Used in dumplings.[15]\r\nChrysanthemum — Used for dumplings.[15]\r\nCoconut — Used to make macaroons.[17]\r\nCucumberquat — Used dried or in rice by the Air Nomads.[11]\r\nJackfruit — Used as filling for pies. Can be candied.[22]\r\nLemon — Used in desserts.[23]\r\nLychee nut — A fruit from the Earth Kingdom that the Air Nomads used for their recipes.[11]\r\nMango — Fruit used dried in sweet rice.[11]\r\nMomo eats a moon peach\r\nBoth Momo and Appa loved moon peaches.\r\n\r\nMoon peach — Eaten whole with fresh cream.[7][13]\r\nMung beans — A legume.[24][5]\r\nNuts — Eaten for a snack.[25]\r\nOnion — Used for juices.[20]\r\nOrange — Known to be found at the Western Air Temple.[26]\r\nOyster mushroom — Usually steamed.[16]\r\nPear — Edible green fruit.[27]\r\nPepper — Usually steamed.[16]\r\nPickles — Used as an ingredient.[20]\r\nPistachios — Used as an ingredient.[23]\r\nPlum — Used as filling in fruit pies.[28]\r\nPotato — Usually steamed.[16]\r\nRaisins[11]\r\nShiitake — Usually steamed.[16]\r\nSoy — Used to make tofu.[8]\r\nTaro — Usually steamed.[16]\r\nTomato — Usually steamed.[16]\r\nYam — Tuber; usually steamed.[16]\r\nGrains\r\nBarley — Used for tsampa.[12]\r\nFlour — Used to make dough for pies, tarts, and other dishes.[29] Also added to Air Nomad style tea.[30]\r\nRice[11]\r\nDishes\r\nDumplings — Filled with vegetables such as cabbage and ginger, chayote and carrot, and sometimes with milk.[31][15]\r\nEgg custard tart — Baked tart with an egg custard center.[32]\r\nFruit pie — Baked pastries filled with minced fruit.[7][23]\r\nCandied jackfruit pie — A pie developed by Monk Gyatso. As part of his airbending training, Gyatso would send the pastry flying toward unsuspecting victims.[22]\r\nMacaroon — Cookie-shaped confection[33] made with coconut. Korra featured the recipe in her book, An Avatar's Chronicle.[17]\r\nMung bean & tofu curry[5][24]\r\nNoodle soup[21]\r\nRice — Eaten as a side dish.\r\nRoasted seaweed[34]\r\nSky bison biscuits — Crackers primarily intended for flying bison, but can be eaten by humans.[10]\r\nSteamed tofu[8]\r\nSteamed vegetables — According to Avatar Aang, no temple dinner was complete without a plate of steamed vegetables.[16]\r\nSweet buns — Glutinous rice dumplings wrapped in large flat leaves.[33]\r\nSweet red bean cake[21]\r\nSweet rice — A combination of rice and sweet fruits. The Air Nomads used ingredients to experiment with from across the nations to cook this dish in order to make it adaptable wherever they traveled.[11]\r\nTsampa — Made with barley. Tsampa was one of Aang's regular mid-training snacks during his long lessons with Monk Gyatso. The young Air Nomads used to watch the monks roast the barley for tsampa by airbending in big whiffs of hot sand until the temple kitchen would be filled with its nutty scent.[12]\r\nTofu and bean sprouts — Ceremonial meal consumed during Yangchen's Festival.[9]\r\nTofu curry — A rich and creamy dish with minimal spices, served on a warm bed of rice. It was Kelsang's favorite dish, which Kyoshi would always volunteer to cook.[35]\r\nBeverages\r\nLychee juice — Made from lychee nuts.[36]\r\nOnion-banana juice — A beverage using for cleansing chakras, and which was considered by Aang to taste like pickles.[20][37]\r\nTea — Made from a variety of leaves in hot water. The Air Nomad style includes flour.[30] They also made butter tea to keep their bodies warm and balanced, and to greet their friends from other air temples as a special sign of welcome.[12]"
}